{
  "basics": {
    "name": "Jesús Alberto Rodríguez Puertos",
    "label": "Desarrollador Web Jr.",
    "image": "/me.jpg",
    "email": "jesuspuertos.engineer@gmail.com",
    "phone": "+52 272 266-2474",
    "url": "https://jesus-puertosdev.netlify.app/",
    "summary": "Desarrollador Web FullStack Jr. con experiencia en proyectos de alto impacto, incluyendo hackathones nacionales y soluciones empresariales. Especializado en React, Astro, Tailwind y Node.js. Reconocido con el tercer lugar en HackaTECNM 2025 a nivel nacional y primer lugar en 2024 a nivel regional. Capaz de combinar desarrollo, documentación técnica y liderazgo para crear plataformas eficientes y escalables.",
    "location": {
      "address": "",
      "postalCode": "95060",
      "city": "Tlilapan",
      "countryCode": "MX",
      "region": "Veracruz"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "Jesús Rodríguez",
        "url": "https://www.linkedin.com/in/jesús-puertos-mx/"
      },
      {
        "network": "GitHub",
        "username": "jesuspuertos",
        "url": "https://github.com/jesus-puertos"
      }
    ]
  },
  "work": [{
  "name": "Logística Embotelladora del Sur S.A. de C.V. (Heineken CEDIS Tlilapan)",
  "position": "Asistente de Logística",
  "startDate": "2025-06-01",
  "endDate": null,
  "summary": "Apoyé en procesos de logística, control de entregas, auditoría de inventarios y organización de rutas de reparto, desarrollando habilidades de trabajo bajo presión y análisis operativo."
}
,
   {
  "name": "Nexus - Digitalización de Polos de Desarrollo Económico",
  "position": "Documentador Técnico y Coordinador de Equipo",
  "url": "https://nexus-umber-eta.vercel.app/",
  "startDate": "2025-11-24",
  "endDate": "2025-11-28",
  "summary": "Participé en la construcción del proyecto Nexus como responsable de la memoria técnica, la estructuración del problema, el diseño conceptual de la solución y la coordinación general del equipo. Mi labor se centró en traducir necesidades reales de los Polos de Desarrollo Económico en una propuesta tecnológica clara, sólida y viable.",
  "highlights": [
    "Redacción completa de la memoria técnica del proyecto, incluyendo planteamiento del problema, análisis de necesidades, arquitectura conceptual y justificación de la solución.",
    "Definición clara del modelo de negocio, nodos del sistema, flujo de usuarios y alcances del proyecto para garantizar coherencia técnica y estratégica.",
    "Guía y acompañamiento al equipo de desarrollo para mantener alineación entre la documentación, la visión del proyecto y la implementación técnica.",
    "Generación de ideas clave para estructurar los módulos principales de Nexus: marketplace, ERP simplificado, logística y geolocalización.",
    "Organización del trabajo en equipo, toma de decisiones y apoyo en la presentación del proyecto durante HackaTECNM 2025.",
    "Comunicación efectiva con el equipo multidisciplinario para resolver dudas, clarificar requerimientos y mantener el enfoque en la problemática nacional."
  ]
},
    {
      "name": "HackaTECNM 2024",
      "position": "Desarrollador AR",
      "url": "https://volvoar.dev",
      "startDate": "2024-11-18",
      "endDate": "2024-11-22",
      "summary": "Participé en el desarrollo de una aplicación innovadora de realidad aumentada para manipular modelos 3D en un entorno interactivo, diseñada específicamente para satisfacer las necesidades de Volvo Group S.A de C.V. Este proyecto destacó por su enfoque en la experiencia del usuario y la integración de tecnologías avanzadas de AR.",
      "highlights": [
        "Diseño e implementación de un sistema de manipulación 3D que permite la visualización, rotación y expansión de modelos en tiempo real.",
        "Desarrollo de herramientas para la medición precisa de distancias y dimensiones dentro de entornos inmersivos.",
        "Colaboración efectiva con un equipo multidisciplinario de desarrolladores, diseñadores y representantes de la industria automotriz.",
        "Optimización del rendimiento de la aplicación para garantizar una experiencia fluida y sin interrupciones en dispositivos modernos.",
        "Presentación del proyecto en la fase nacional de InnovaTECNM 2024, destacando por su creatividad y aplicabilidad en el sector automotriz.",
        "Resolución de problemas técnicos complejos relacionados con la interacción entre modelos 3D y el entorno AR."
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "Tecnológico Nacional de México, Campus Zongolica",
      "url": "http://www.tecnm.mx/",
      "area": "Ingeniería en Sistemas Computacionales",
      "description": "Estudiante de Ingeniería en Sistemas Computacionales. He desarrollado soluciones como una plataforma integral para actividades complementarias y he participado en competencias tecnológicas, obteniendo reconocimientos destacados como el primer lugar en HackaTECNM 2024.",
      "studyType": "Bachelor",
      "startDate": "2020-08-01",
      "endDate": null,
      "score": "9.3",
      "courses": [
        "Desarrollo Web con React",
        "Metodologías Ágiles (SCRUM)"
      ]
    },
    {
      "institution": "Centro Bachillerato Tecnológico Agropecuario No. 280",
      "url": "http://cbta280.edu.mx/",
      "area": "Técnico en Ofimática",
      "description": "Durante mi estancia en el Centro Bachillerato Tecnológico Agropecuario, adquirí conocimientos técnicos en ofimática y mantenimiento de hardware.",
      "studyType": "High School",
      "startDate": "2016-08-01",
      "endDate": "2019-06-01",
      "score": "9.0",
      "courses": ["Mantenimiento de hardware", "Programación básica"]
    }
  ],
  "awards": [
  {
    "title": "Tercer lugar nacional en HackaTECNM 2025",
    "year": 2025,
    "description": "Reconocimiento obtenido con el proyecto Nexus, destacando por innovación, documentación técnica y aplicabilidad nacional."
  },
  {
    "title": "Primer lugar regional en HackaTECNM 2024",
    "year": 2024,
    "description": "Premio otorgado al proyecto BeelTraveler por su impacto en el sector turístico regional."
  },
  {
    "title": "Presentación nacional ante Volvo Group",
    "year": 2024,
    "description": "Exposición de un sistema AR para manipulación 3D, desarrollado en la etapa nacional de InnovaTECNM."
  }
]
,
  "certificates": [],
  "publications": [],
 "skills": [
  { "name": "HTML", "category": "Frontend" },
  { "name": "CSS", "category": "Frontend" },
  { "name": "JavaScript", "category": "Frontend" },
  { "name": "TypeScript", "category": "Frontend" },
  { "name": "React", "category": "Frontend" },
  { "name": "Astro", "category": "Frontend" },

  { "name": "Node.js", "category": "Backend" },
  { "name": "MySQL", "category": "Backend" },

  { "name": "Git", "category": "Tools" },
  { "name": "GitHub", "category": "Tools" }
]
,
  "languages": [
    {
      "language": "Español",
      "fluency": "Nativo"
    },
    {
      "language": "Inglés",
      "fluency": "Intermedio Avanzado"
    }
  ],
  "interests": [],
  "references": [],
  "projects": [
    {
      "name": "BeelTraveler",
      "isActive": true,
      "description": "Plataforma digital para conectar agencias de turismo con clientes y guías locales, promoviendo la economía regional.",
      "highlights": [
        "Diseñada con Astro, React y MySQL.",
        "Ganadora del primer lugar en HackaTECNM 2024."
      ],
      "url": "https://beeltraveler-repo-tecnm.vercel.app/"
    },
    {
      "name": "Sistema de Gestión de Complementarias",
      "isActive": true,
      "description": "Plataforma integral para el registro y consulta de actividades complementarias de los estudiantes, incluyendo horarios, documentación, y progreso académico.",
      "highlights": [
        "Implementó medidas avanzadas de seguridad en formularios.",
        "Facilitó la consulta y gestión de horarios y cargas académicas en tiempo real."
      ],
      "github": "https://github.com/Jesus-Puertos/complementarias-proyecto.git"
    }
  ]
}
